; IIDXRecorder v0.6
; 修改后重启游戏生效。文件为 UTF-16 LE 编码，请保留编码以支持中文路径。
; 自动模式文件名：录像开始日期_模式_歌名或段位.mp4；Arena 或名称不可用时省略末项。
; 示例：2026-09-15_Standard_冥.mp4、2026-09-15_段位_SP九段.mp4、2026-09-15_Arena.mp4
; 同名自动追加 _2、_3 等，不覆盖已有录像；歌名中的非法文件名字符替换为下划线。

[Recorder]
; 文件名是否包含开始录制的时间。仅 AutoRecord=1 生效。
; 可选：0=日期_模式_名称（默认）；1=日期_时-分-秒_模式_名称。
; 示例：2026-09-15_段位_SP九段.mp4 或 2026-09-15_00-23-05_段位_SP九段.mp4。
; 日期文件夹仍只使用日期；同秒同名仍自动追加序号。
FilenameTime=0

; 插件总开关。可选：0=停用，1=启用（默认）。
Enabled=1

; 游戏模块文件名。默认 bm2dx.dll；通常无需修改。
GameModule=bm2dx.dll

; 保存位置。可填相对 DLL 的目录或绝对路径，支持中文与环境变量。
; 示例：recordings、D:\IIDX录像、%USERPROFILE%\Videos\IIDX。
OutputPath=recordings

; 保存目录布局。可选：0=直接存入 OutputPath（默认）；1=存入 OutputPath\YYYY-MM-DD。
; 文件夹日期与文件名日期都按开始录制的本地日期计算；跨午夜不拆分整局。
DateFolders=0

; 仅 AutoRecord=0 的旧被动录制路径使用；AutoRecord=1 时此项无效。
; 可选：0=普通 MP4（默认），1=分片 MP4。当前自动模式不保证强退后文件完整。
FragmentedMP4=0

; 仅 AutoRecord=0 使用：刷新已写入数据的间隔，单位毫秒。
; 可选：100～10000 的整数，默认 1000；越界会限制到此范围，不会强制编码器输出。
FlushIntervalMs=1000

[Native]
; 自动录制开关。可选：1=无按钮自动原生录制并本地保存（默认）。
; 0=旧被动镜像路径：需游戏自行启动录像，可能只得到中间轨道；旧路径保留旧文件名。
; 两种路径均不切换 ASIO，不录麦克风；自动模式声音取自游戏内部。
AutoRecord=1

; 段位／Arena 连续录制。可选：1=从第一曲开始，保留曲间并在离开总结果页时保存（默认）。
; 0=退回逐阶段保存；仅 AutoRecord=1 时有作用。Standard／Step Up／PF 仍按单曲保存。
; 段位连续录制已实机验证；Arena 尚待实机验证。
ContinuousCourses=1

; 录制帧率。可选：0=游戏默认（推荐）、30、60、120；其他值退回默认。
; 本版本游戏默认主录制参数为 60 FPS；自定义覆盖尚未实机验证。
FPS=0

; 录制宽、高（像素）。两项均为 0=游戏默认（推荐，目前原生参数 1920×1080）。
; 自定义需同时填写偶数：Width 为 640～3840，Height 为 360～2160。
; 示例：1280 和 720；1920 和 1080。任一项无效则两项均退回游戏默认。
; 自定义分辨率覆盖尚未实机验证。
Width=0
Height=0

; AAC 音频码率，单位 kbps。可选：0=游戏默认（推荐，目前原生参数 160）。
; 自定义可选：64、96、128、160、192、224、256、288、320；其他值退回默认。
; 此项不改变 ASIO 延迟或音频来源；自定义码率覆盖尚未实机验证。
AACBitrateKbps=0